{
  "model": {
    "specs": {
      "class_name": "Sequential",
      "config": {
        "name": "sequential",
        "layers": [
          {
            "class_name": "LSTM",
            "config": {
              "name": "lstm",
              "trainable": true,
              "batch_input_shape": [
                null,
                1,
                1
              ],
              "dtype": "float32",
              "return_sequences": false,
              "return_state": false,
              "go_backwards": false,
              "stateful": false,
              "unroll": false,
              "time_major": false,
              "units": 1,
              "activation": "tanh",
              "recurrent_activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "recurrent_initializer": {
                "class_name": "Orthogonal",
                "config": {
                  "gain": 1.0,
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "unit_forget_bias": true,
              "kernel_regularizer": null,
              "recurrent_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "recurrent_constraint": null,
              "bias_constraint": null,
              "dropout": 0.0,
              "recurrent_dropout": 0.0,
              "implementation": 2
            }
          }
        ]
      },
      "keras_version": "2.2.4-tf",
      "backend": "tensorflow"
    },
    "weights": [
      [
        [
          0.1,
          0.2,
          0.3,
          0.4
        ]
      ],
      [
        [
          0.5,
          0.6,
          0.7,
          0.8
        ]
      ],
      [
        0.9,
        0.01,
        0.11,
        0.21
      ]
    ]
  },
  "schema": "orquestra-v1-model"
}